<?php

namespace Database\Seeders;

use App\Models\Course;
use App\Models\Department;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $courses = [
            [
                'name' => 'مدخل إلى هندسة البرمجيات',
                'slag' => 'هاب 211',
                'description' => 'يعتبر هذا المقرر محوريا حيث يقدم المبادئ الرئيسية ومفاهيم هندسة البرمجيات ويعطي أساسا صلبا لمقررات أخرى في هذا المجال. ويغطى المقرر أهم التعريفات والمفاهيم في هندسة البرمجيات ودورة حياة وعمليات البرمجيات وأساسيات وهندسة المتطلبات، مدخل إلى البرمجة السريعة والمتطرفة -أساسيات النمذجة والتصميم -أساسيات إدارة المشاريع وتقدير تكلفة البرمجيات وإدارة التغيير واختبار البرمجيات. ومقدمة عن الأخلاقيات والممارسة المهنية لهندسة البرمجيات، يشارك الطلاب في مشروع جماعي عن دورة حياة البرمجيات وباستخدام أدوات برمجية مختصة.',
                'hours' => '3',
                'prerequisite' => 'ريض١٥١ + عال١١١',
                'status' => 'أجباري',
                'level' => '4',
                'supervisor_id' => '2'
            ],
            [
                'name' => 'هندسة متطلبات البرمجيات',
                'slag' => 'هاب٣١٢',
                'description' => 'عملية هندسة البرمجيات، جمع المتطلبات، المتطلبات الوظيفية وغير الوظيفية، خدمات وقيود النظام، جودة المتطلبات -مصفوفة متابعة المتطلبات، قياسات المتطلبات غير الوظيفية -شرح حالة الاستخدام، المخططات التأطيرية ومخططات حالة الاستخدام -توصيف متطلبات البرمجيات، معيارية IEEE - المتطلبات في طرق التطوير السريعة، المتطلبات لأنظمة مختلفة -: الأنظمة المضمنة، أنظمة الويب، أنظمة إدارة الأعمال وإدارة المتطلبات. سيتم مناقشة السلوك الأخلاقي لتحليل البرمجيات عند جمع المتطلبات مع الجهات المعنية. ويعطي المقرر أيضا مقدمة في مواصفات قياسية باستخدام لغات رسمية مثل Z أو B يشارك الطلاب في مشروع جماعي في هندسة متطلبات البرمجيات.',
                'hours' => '3',
                'prerequisite' => 'عال١١٣ + هاب٢١١',
                'status' => 'اجباري',
                'level' => '5',
                'supervisor_id' => '2'
            ],
            [
                'name' => 'تصميم وعمارة البرمجيات',
                'slag' => 'هاب٣٢١',
                'description' => 'مقدمة في عمارة وتصميم البرمجيات، تطور البرمجيات ومرونتها -مدخل أنماط التصميم -نماذج نظم الخادم والعميل والطبقات المتعددة والنموذج-الواجهة-التحكم. الخ، نماذج الأنابيب للبرمجيات الشيئية والوظيفية -نماذج التحكم والنماذج المركزية والحديثة، تصميم البرمجيات وإعادة الاستخدام، الاستخدام المتعدد لأجزاء التطبيقات البرمجية، إطارات التطبيقات -عمارة البرمجيات الوسطية مثل COM، .NET. وكذلك مقدمة في هيكل الخدمات الشيئية كما يشمل المقرر على قيام الطلاب بمشروعات جماعية في تصميم وعمارة البرمجيات.',
                'hours' => '3',
                'prerequisite' => 'هاب٣١٢ + هاب٣١٤',
                'status' => 'أجباري',
                'level' => '6',
                'supervisor_id' => '2'
            ],
            [
                'name' => 'ضمان جودة البرمجيات',
                'slag' => 'هاب٣٣٣',
                'description' => 'مفاهيم الجودة، ضمان جودة البرمجيات، إدارة جودة البرمجيات، التخطيط ومراقبة جودة البرمجيات، دليل الجودة، معايير العمليات والمنتجات -صفات الجودة الخارجية والداخلية للبرمجيات، مراجعة البرمجيات وتتبعها وفحصها ، ضمان جودة البرمجيات الإحصائية ، إدارة توصيف البرمجيات - اعتمادية البرمجيات ، نماذج جودة البرمجيات ، المعايير الدولية للجودة مثل أيزو 9000 للجودة وأيزو 9000-3 وغيرها - تحسين عملية البرمجيات - نموذج نضوج القدرة (CMM) ، الكروت المتوازنة. وسيتم مناقشة المسؤوليات الأخلاقية لتطوير برمجيات ذات جودة عالية. يشارك الطلاب في مشروع جماعي في ضمان جودة البرمجيات.',
                'hours' => '2',
                'prerequisite' => 'هاب٣١٢',
                'status' => 'اجباري',
                'level' => '6',
                'supervisor_id' => '2'
            ]
        ];
        $department = Department::find(1);
        foreach ($courses as $data) {
            $course = Course::create($data);
            $course->department()->attach($department);
        }
    }
}
